# Ejercicios diarios mySQL

In [1]:
## Conectarse a docker y pandas
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine("mysql+pymysql://root:root@127.0.0.1:3306/sakila")

df = pd.read_sql("SELECT category, COUNT(*) AS n FROM film_list GROUP BY category ORDER BY n DESC;", engine)
df.head()

      category   n
0       Sports  74
1      Foreign  73
2       Family  69
3  Documentary  68
4    Animation  66

In [3]:
pd.read_sql("SHOW TABLES;", engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

In [4]:
pd.read_sql("DESCRIBE film_list;", engine)

         Field                                Type Null Key Default Extra
0          FID                   smallint unsigned   NO           0
1        title                        varchar(128)   NO         NaN
2  description                                text  YES         NaN
3     category                         varchar(25)  YES         NaN
4        price                        decimal(4,2)   NO        4.99
5       length                   smallint unsigned  YES         NaN
6       rating  enum('G','PG','PG-13','R','NC-17')  YES           G
7       actors                                text  YES         NaN

In [5]:
pd.read_sql("SELECT title FROM film_list WHERE category = 'Documentary';", engine)

                  title
0      ACADEMY DINOSAUR
1      ADAPTATION HOLES
2      ARMY FLINTSTONES
3   BEACH HEARTBREAKERS
4          BED HIGHBALL
..                  ...
63           WARS PLUTO
64       WEDDING APOLLO
65            WIFE TURN
66           WRATH MILE
67       YOUNG LANGUAGE

[68 rows x 1 columns]